<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/MySQL_Constraints_Joins_Key.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1><center>Experiment 4</center></h1>
<h2><center>Experiment on various keys and constraints in MYSQL<h3><center>

In [27]:
import mysql.connector
import pandas as pd

In [28]:
conn = mysql.connector.connect( 
  host ="localhost", 
  user ="root", 
  passwd ="password",
  database = "College"
)
cur = conn.cursor()

In [29]:
query = """
    CREATE TABLE IF NOT EXISTS employee(
        id INT(10) PRIMARY KEY, 
        name TEXT NOT NULL,
        phone INT(10),
        email VARCHAR(50) NOT NULL UNIQUE
    )
"""
cur.execute(query)

In [11]:
query = """
    INSERT INTO employee (id, name, phone, email) VALUES
        (1, "Employee A", 983003372, "employee.a@organisation.org"),
        (2, "Employee B", 983003371, "employee.b@organisation.org"),
        (3, "Employee C", 983003373, "employee.c@organisation.org"),
        (4, "Employee D", 983003374, "employee.d@organisation.org"),
        (5, "Employee E", 983003375, "employee.e@organisation.org")
"""
cur.execute(query)

In [30]:
pd.read_sql("SELECT * FROM employee", conn)

   id        name      phone                        email
0   1  Employee A  983003372  employee.a@organisation.org
1   2  Employee B  983003371  employee.b@organisation.org
2   3  Employee C  983003373  employee.c@organisation.org
3   4  Employee D  983003374  employee.d@organisation.org
4   5  Employee E  983003375  employee.e@organisation.org

In [42]:
query = """
    CREATE TABLE if not exists staff1(
        id INT(10) PRIMARY KEY, 
        department varchar(20) NOT NULL DEFAULT 'administration',
        emp_id INT(10),
        FOREIGN KEY (emp_id) REFERENCES employee(id)
    )
"""
cur.execute(query)

In [38]:
query = """
    CREATE TABLE IF NOT EXISTS faculty1(
        id INT(10) PRIMARY KEY, 
        department TEXT,
        designation TEXT,
        age INT(2) CHECK (age <= 60),
        emp_id INT(10),
        FOREIGN KEY (emp_id) REFERENCES employee(id)
    )
"""
cur.execute(query)

In [43]:
query = """
    INSERT INTO staff1 (id, department, emp_id) VALUES
        (911, "security", 1),
        (921, "accounts", 2)
"""
cur.execute(query)

query = """
    INSERT INTO staff1 (id, emp_id) VALUES
        (931, 3)
"""
cur.execute(query)

In [44]:
pd.read_sql("SELECT * FROM staff1", conn)

    id      department  emp_id
0  911        security       1
1  921        accounts       2
2  931  administration       3

In [31]:
query = """
    INSERT INTO faculty1 (id, department, designation, age, emp_id) VALUES
        (81, "CSE", "Assistant Professor", 67, 4),
        (82, "ME", "Associate Professor", 45, 5)
"""
cur.execute(query)

DatabaseError: ignored

In [45]:
query = """
    INSERT INTO faculty1 (id, department, designation, age, emp_id) VALUES
        (81, "CSE", "Assistant Professor", 30, 4),
        (82, "ME", "Associate Professor", 45, 5)
"""
cur.execute(query)

In [46]:
pd.read_sql("SELECT * FROM faculty1", conn)

   id department          designation  age  emp_id
0  81        CSE  Assistant Professor   30       4
1  82         ME  Associate Professor   45       5

In [47]:
query = """SELECT employee.id, employee.name, employee.email,
    faculty1.id, faculty1.department, faculty1.age
    FROM employee INNER JOIN faculty1
    ON faculty1.emp_id = employee.id"""
pd.read_sql(query, conn)

   id        name                        email  id department  age
0   4  Employee D  employee.d@organisation.org  81        CSE   30
1   5  Employee E  employee.e@organisation.org  82         ME   45